In [1]:
import pandas as pd

In [2]:
employees=pd.DataFrame({
 "empID":[1,2,3],
 "Name":["Suraj","Swami","Kunal"],
 "DepID":[10,20,30]
})

In [3]:
employees

   empID   Name  DepID
0      1  Suraj     10
1      2  Swami     20
2      3  Kunal     30

In [8]:
department=pd.DataFrame({
  "DepID":[10,20,40],
  "Depname":["HR","IT","devops"]
})

In [9]:
department

   DepID Depname
0     10      HR
1     20      IT
2     40  devops

In [10]:
# merging of two columns with there common column
pd.merge(employees,department, on="DepID") # Inner join

   empID   Name  DepID Depname
0      1  Suraj     10      HR
1      2  Swami     20      IT

In [12]:
pd.merge(employees,department, on="DepID",how="left") # left join

   empID   Name  DepID Depname
0      1  Suraj     10      HR
1      2  Swami     20      IT
2      3  Kunal     30     NaN

In [13]:
pd.merge(employees,department, on="DepID",how="right") # right join

   empID   Name  DepID Depname
0    1.0  Suraj     10      HR
1    2.0  Swami     20      IT
2    NaN    NaN     40  devops

In [15]:
pd.merge(employees,department, on="DepID",how="outer") # outer join

   empID   Name  DepID Depname
0    1.0  Suraj     10      HR
1    2.0  Swami     20      IT
2    3.0  Kunal     30     NaN
3    NaN    NaN     40  devops

In [16]:
# concatinate 
df1=pd.DataFrame({"name":["Suraj","Swami"],"Age":[20,20]})

In [17]:
df2=pd.DataFrame({"name":["Aditya","Om"],"Score":[95,90]})

In [18]:
df1

    name  Age
0  Suraj   20
1  Swami   20

In [19]:
df2

     name  Score
0  Aditya     95
1      Om     90

In [23]:
pd.concat([df1,df2])

     name   Age  Score
0   Suraj  20.0    NaN
1   Swami  20.0    NaN
0  Aditya   NaN   95.0
1      Om   NaN   90.0